# Pandas DataFrame Setting

This notebook demonstrates various basic operations using Pandas DataFrame, including creating a DataFrame, setting values by label and position, and adding columns.

In [2]:
import pandas as pd
import numpy as np

## Creating a DataFrame

We will create a DataFrame to represent student data, including names and ages.

In [3]:
# Create a list of lists representing student data
students = [
    ['Eric', 40],
    ['Ivy', 37],
    ['Jude', 10],
]

# Define the column names for the DataFrame
columns = ['Name', 'Age']

# Create an index for the DataFrame
index = list(range(1, len(students) + 1))

# Create a Pandas DataFrame from the students list with the specified columns and index
students_df = pd.DataFrame(students, columns=columns, index=index)

# Display the DataFrame
students_df

   Name  Age
1  Eric   40
2   Ivy   37
3  Jude   10

## Adding a New Column

We will add a new column to the DataFrame representing the courses each student is taking.

In [4]:
# Setting a new column automatically aligns the data by the indexes:
courses = ['Machine Learning', 'Project Management', 'Programmer']
course_series = pd.Series(courses, index=index)
students_df['Courses'] = course_series

# Display the updated DataFrame
students_df

   Name  Age             Courses
1  Eric   40    Machine Learning
2   Ivy   37  Project Management
3  Jude   10          Programmer

## Setting Values by Label

We will update the age of the second student (Ivy) by using the label-based index.

In [5]:
# Setting values by label:
students_df.at[index[1], 'Age'] = 38

# Display the updated DataFrame
students_df

   Name  Age             Courses
1  Eric   40    Machine Learning
2   Ivy   38  Project Management
3  Jude   10          Programmer

## Setting Values by Position

We will update the age of the first student (Eric) by using the position-based index.

In [6]:
# Setting values by position:
students_df.iat[0, 1] = 45

# Display the updated DataFrame
students_df

   Name  Age             Courses
1  Eric   45    Machine Learning
2   Ivy   38  Project Management
3  Jude   10          Programmer

## Adding a Column with NumPy Array

We will add a new column representing the GPA of each student by assigning a NumPy array to the DataFrame.

In [7]:
# Setting column by assigning with a NumPy array:
students_df['GPA'] = np.array([4] * len(students_df))

# Display the final DataFrame
students_df

   Name  Age             Courses  GPA
1  Eric   45    Machine Learning    4
2   Ivy   38  Project Management    4
3  Jude   10          Programmer    4